import logging
import sys
from datetime import datetime
'''
算卦
    算卦前洗手，心中想自己要算的内容
    硬币正面=3，反面=2，3枚硬币同时抛出，求和，占6次，硬币掉到地上也算
    6次求和数字按照顺序从下往上依次排列，老阳老阴会变卦，少阳少阴不变卦
    6 老阴
    7 少阳
    8 少阴
    9 老阳
解卦
    卦辞：这个卦的卦象的解释
    爻辞：一个卦有六个爻，每一个爻的解释
    变爻：本卦6和9是老阴和老阳，需要阴变阳，阳变阴，是为变爻
    变爻个数：
        0 根据本卦卦辞解卦
        1 根据本卦变爻爻辞解卦
        2 根据本卦变爻爻辞解卦，以上爻为主
        3 根据本卦和变卦卦辞解卦，本卦为主，变卦为辅
        4 根据本卦没有变爻的爻辞解卦，以下爻为主
        5 根据变卦的未变爻辞解卦
        6 根据变卦卦辞解卦

    本卦：占卜出来最开始的阴阳组合
    变卦：本卦变爻改变后的阴阳组合
    互卦：上卦取本卦的543爻，下卦取本卦432爻，这样重新组合形成的卦
    错卦：本卦阴阳全颠倒的卦，即每个爻 阴变阳、阳变阴而得到的卦
    综卦：把本卦倒过来看。它们通常是从事物的反面来看事物的发展变化
    本卦代表的是目前的情况
    互卦为事情发展的过程
    变卦为事情发展的结果
    错卦是一种从反面的角度
    综卦是从另外一种角度来思考要测的事情
五行
    金-->乾兑
    木-->震巽
    土-->坤艮
    水-->坎
    火-->离
    相生 金-->水-->木-->火-->土-->金
    相克 金-->木-->土-->水-->火-->金
    
    体卦（静卦）：本卦中没有动爻的那个卦
    用卦（动卦）：本卦中有动爻的那个卦
    用克体为不吉
    用生体为吉
'''


def 算卦():
    输入数字范围 = [2, 3]
    输对次数 = 0
    输错次数 = 0

    八卦 = {'阳阳阳': '乾天', '阴阳阳': '兑泽', '阳阴阳': '离火', '阴阴阳': '震雷', '阳阳阴': '巽风', '阴阳阴': '坎水', '阳阴阴': '艮山', '阴阴阴': '坤地'}
    五行 = {'乾': '金', '兑': '金', '震': '木', '巽': '木', '坤': '土', '艮': '土', '坎': '水', '离': '火'}
    相生 = {'金': '水', '水': '木', '木': '火', '火': '土', '土': '金'}
    相克 = {'金': '木', '木': '土', '土': '水', '水': '火', '火': '金'}
    六爻位置 = ['上', '五', '四', '三', '二', '初']
    本卦匹配 = {6: '阴', 7: '阳', 8: '阴', 9: '阳'}
    变卦匹配 = {6: '阳', 7: '阳', 8: '阴', 9: '阴'}
    六爻 = []
    六爻数字 = []
    体卦 = []
    用卦 = []

    你想测什么 = input(f"你想测什么\n")
    while 输对次数 < 6:
        当前输入数字 = input(f"请输入第{输对次数 + 1}组数字, 正面为3, 背面为2\n")
        if len(当前输入数字) != 3:
            logging.warning('输入错误，请输入正确的数字，正面为3，反面为2')
            输错次数 += 1
            if 输错次数 >= 3:
                logging.warning('老是输错，你算个锤子')
                sys.exit(1)
            continue
        
        try:
            硬币一, 硬币二, 硬币三 = int(当前输入数字[0]), int(当前输入数字[1]), int(当前输入数字[2])
        except:
            logging.warning('输入错误，请输入正确的数字，正面为3，反面为2，不要输入其他字符')
            输错次数 += 1
            if 输错次数 >= 3:
                logging.warning('老是输错，你算个锤子')
                sys.exit(1)
            continue

        if 硬币一 not in 输入数字范围 or 硬币二 not in 输入数字范围 or 硬币三 not in 输入数字范围:
            logging.warning('输入错误，请输入正确的数字，正面为3，反面为2')
            输错次数 += 1
            if 输错次数 >= 3:
                logging.warning('老是输错，你算个锤子')
                sys.exit(1)
            continue

        六爻数字.insert(0, 当前输入数字)
        六爻.insert(0, 硬币一 + 硬币二 + 硬币三)
        输对次数 += 1

    print('你输入的六组数字依次是：')
    for idx, i in enumerate(六爻数字):
        当前数字总和 = int(i[0]) + int(i[1]) + int(i[2])
        阴阳 = '九' if (当前数字总和) % 2 else '六'
        if idx == 0 or idx == 5:
            prefix = f'{六爻位置[idx]}{阴阳}'
        else:
            prefix = f'{阴阳}{六爻位置[idx]}'

        if i == '222' or i == '333':
            print(f'{prefix}: {i} == {当前数字总和} --> 变爻')
        else:
            print(f'{prefix}: {i} == {当前数字总和}')

    本卦 = ''.join([本卦匹配[i] for i in 六爻])
    变卦 = ''.join([变卦匹配[i] for i in 六爻])
    互卦 = ''.join([本卦[1], 本卦[2], 本卦[3], 本卦[2], 本卦[3], 本卦[4]])

    if (6 in 六爻[:3] or 9 in 六爻[:3]) and (6 not in 六爻[3:] and 9 not in 六爻[3:]):
        体卦 = ''.join(本卦[3:])
        用卦 = ''.join(本卦[:3])
    elif (6 not in 六爻[:3] and 9 not in 六爻[:3]) and (6 in 六爻[3:] or 9 in 六爻[3:]):
        体卦 = ''.join(本卦[:3])
        用卦 = ''.join(本卦[3:])

    def 专业语法(卦象):
        if 卦象[:3] != 卦象[3:]:
            卦象 = f'{八卦[卦象[:3]][0]}{八卦[卦象[3:]][0]}({八卦[卦象[:3]][1]}{八卦[卦象[3:]][1]})'
        else:
            卦象 = f'{八卦[卦象[:3]][0]}为{八卦[卦象[:3]][1]}'
        return 卦象

    本卦 = 专业语法(本卦)
    变卦 = 专业语法(变卦)
    互卦 = 专业语法(互卦)

    if 体卦:
        体卦 = f'{八卦[体卦[:3]]}'
        用卦 = f'{八卦[用卦[:3]]}'
    curr_time = datetime.now()
    curr_time = f'{curr_time.year}/{curr_time.month}/{curr_time.day}'
    with open('算卦记录.txt', 'a') as f:
        f.write(f'{curr_time}: {你想测什么}\n')
        print(f'本卦是{本卦}')
        f.write(f'本卦是{本卦}\n')
        print(f'变卦是{变卦}')
        f.write(f'变卦是{变卦}\n')
        print(f'互卦是{互卦}')
        f.write(f'互卦是{互卦}\n')
        if 体卦:
            体卦五行 = 五行[体卦[0]]
            用卦五行 = 五行[用卦[0]]
            print(f'体卦是{体卦}({体卦五行})')
            f.write(f'体卦是{体卦}({体卦五行})\n')
            print(f'用卦是{用卦}({用卦五行})')
            f.write(f'用卦是{用卦}({用卦五行})\n')
            if 相生[体卦五行] == 用卦五行:
                print('体卦生用卦，不吉')
                f.write('体卦生用卦，不吉\n')
            elif 相克[体卦五行] == 用卦五行:
                print('体卦克用卦，小吉')
                f.write('体卦克用卦，小吉\n')
            elif 相生[用卦五行] == 体卦五行:
                print('用卦生体卦，吉')
                f.write('用卦生体卦，吉\n')
            elif 相克[用卦五行] == 体卦五行:
                print('用卦克体卦，不吉')
                f.write('用卦克体卦，不吉\n')
            else:
                print('体用没有相生相克关系')
                f.write('体用没有相生相克关系\n')

        else:
            print('没有体卦和用卦')
            f.write('没有体卦和用卦\n')


算卦()
